TheZeroHz/ESP32CSI_Vision/idf_examples/08_FaceDetect/sdkconfig.defaults.esp32p4
# ESP32-P4 defaults (Guition JC-ESP32P4-M3 / 16MB flash / PSRAM)
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_FREERTOS_HZ=1000

# Arduino-as-component
CONFIG_AUTOSTART_ARDUINO=y

# ESP-DL human face detect model in flash rodata
CONFIG_HUMAN_FACE_DETECT_MODEL_IN_FLASH_RODATA=y
